### Kaggle: IBM Attrition

Uncover the factors that lead to employee attrition and explore important questions such as:

1. Show a breakdown of distance from home by job role and attrition.

2. Compare average monthly income by education and attrition.

In [2]:
import pandas as pd
import matplotlib.pyplot as plt

import IBM_Attrition csv

In [3]:
attrition = pd.read_csv('WA_Fn-UseC_-HR-Employee-Attrition.csv')
attrition

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

1. Show a breakdown of distance from home by job role and attrition.

#Display only attrition, Distance from home and job role
df = attrition.iloc[0:, [1,5,-20]]
df

In [56]:
df.groupby('JobRole').sum()

                           DistanceFromHome
JobRole
Healthcare Representative              1282
Human Resources                         425
Laboratory Technician                  2437
Manager                                 819
Manufacturing Director                 1375
Research Director                       675
Research Scientist                     2632
Sales Executive                        3149
Sales Representative                    719

In [57]:
df.groupby('Attrition').sum()

           DistanceFromHome
Attrition
No                    10993
Yes                    2520

2. Compare average monthly income by education and attrition.

In [58]:
df1 = attrition.iloc[0:, [1,6,-17]]
df1

     Attrition  Education  MonthlyIncome
0          Yes          2           5993
1           No          1           5130
2          Yes          2           2090
3           No          4           2909
4           No          1           3468
...        ...        ...            ...
1465        No          2           2571
1466        No          1           9991
1467        No          3           6142
1468        No          3           5390
1469        No          3           4404

[1470 rows x 3 columns]

In [59]:
df1.groupby('Education').sum()

           MonthlyIncome
Education
1                 958897
2                1755914
3                3727875
4                2719296
5                 397327

In [72]:
df1.iloc[0:,[0,2]].groupby('Attrition').sum()

           MonthlyIncome
Attrition
No               8424768
Yes              1134541